Autodesk.Revit.DB.BuiltInFailures.ComponentRepeaterSlotFailures.ComponentRepeaterSlot_InvalidFamilyOnReload
Reloaded family not appropriate for repeated component.

Autodesk.Revit.DB.BuiltInFailures.ComponentRepeaterSlotFailures
Failures related to component repeater slots.